In [30]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import chardet

In [12]:
with open("../../Datasets+Data+Science+con+Python+-+Pandas/1.3/Info_pais.csv","rb") as file:
    resultado = chardet.detect(file.read())
print(resultado)

{'encoding': 'ISO-8859-1', 'confidence': 0.73, 'language': ''}

In [13]:
data = pd.read_csv("../../Datasets+Data+Science+con+Python+-+Pandas/1.3/Info_pais.csv", delimiter=";" , encoding="ISO-8859-1" , nrows=5 , index_col=0)
data

                Poblacion  Renta per capita Esperanza de vida
País
United States   325084756             59939              78,9
China          1421021791              8612              76,7
Japan           127502725             38214              84,5
Germany          82658409             44680              81,2
India          1338676785              1980              69,4

In [ ]:
data2 = pd.DataFrame(
    {
        "Nombre":["a","b","c","d"],
        "Edad":[15,13,56,16],
        "Celular":[21545,4545,545415,456456]
    }
)
data2

  Nombre  Edad  Celular
0      a    15    21545
1      b    13     4545
2      c    56   545415
3      d    16   456456

In [21]:
clasico=pd.DataFrame({
    "Nombre":["Juan", "Lucía", "Mario"],
    "Edad": [30, 25, 35],
    "País": ["México", "Argentina", "Chile"]
    })
clasico

  Nombre  Edad       País
0   Juan    30     México
1  Lucía    25  Argentina
2  Mario    35      Chile

In [22]:
nivel2 = pd.DataFrame([
    {"Nombre": "Juan", "Edad": 30, "País": "México"},
    {"Nombre": "Lucía", "Edad": 25, "País": "Argentina"},
    {"Nombre": "Mario", "Edad": 35, "País": "Chile"}
])
nivel2

  Nombre  Edad       País
0   Juan    30     México
1  Lucía    25  Argentina
2  Mario    35      Chile

In [26]:
nivel3=pd.DataFrame(
    [
        ["a",152,"c"],
        ["a",154,"c"],
        ["a",16,"c"]
        
    ]
        ,columns=["Nombre", "Edad", "País"]
        
)

nivel3

  Nombre  Edad País
0      a   152    c
1      a   154    c
2      a    16    c

In [27]:
nivel4 = pd.DataFrame({   
    "Nombre":pd.Series(["Ana", "Luis", "Sofía"], index=[0,1,2]),
    "Edad":pd.Series([25,36,39], index=[0,1,2])
}
)
nivel4

  Nombre  Edad
0    Ana    25
1   Luis    36
2  Sofía    39

In [34]:
import numpy as np
naruto = np.array([
    ["Ana", 25],
    ["Luis", 36],
    ["Sofía", 39]
    ])

nivel5 = pd.DataFrame(
naruto,columns=["Nombre", "Edad"])
nivel5

  Nombre Edad
0    Ana   25
1   Luis   36
2  Sofía   39

In [ ]:
df_csv = pd.read_csv("archivo.csv")
df_excel = pd.read_excel("archivo.xlsx")

In [35]:
import pandas as pd

# Datos para guardar en CSV
data = {
    "Nombre": ["Ana", "Luis", "Sofía", "Miguel"],
    "Edad": [25, 36, 29, 40],
    "País": ["México", "Argentina", "Chile", "Perú"],
    "Fecha": ["2023-01-01", "2023-02-15", "2023-03-20", "2023-04-05"]
}

df = pd.DataFrame(data)
df.to_csv("datos_ejemplo.csv", index=False)

In [57]:
import chardet
with open("datos_ejemplo.csv","rb") as file:
    resultado = chardet.detect(file.read())

print(resultado)

{'encoding': 'utf-8', 'confidence': 0.938125, 'language': ''}

In [70]:
with open("datos_ejemplo.csv","r") as file:
    linea = file.readlines()

In [75]:

columnas = linea[0].strip().split(",")
print(columnas)
print("*"*50)
datos = [linea.strip().split(",") for linea in linea[1:]]
print(datos)
print("*"*50)
df_manual = pd.DataFrame(datos, columns=columnas)

print(df_manual)

['Nombre', 'Edad', 'País', 'Fecha']
**************************************************
[['Ana', '25', 'México', '2023-01-01'], ['Luis', '36', 'Argentina', '2023-02-15'], ['Sofía', '29', 'Chile', '2023-03-20'], ['Miguel', '40', 'Perú', '2023-04-05']]
**************************************************
   Nombre Edad       País       Fecha
0     Ana   25     México  2023-01-01
1    Luis   36  Argentina  2023-02-15
2   Sofía   29      Chile  2023-03-20
3  Miguel   40       Perú  2023-04-05

In [60]:
df_leido = pd.read_csv("datos_ejemplo.csv",
    delimiter=",",
    nrows=5,
    usecols=["Nombre","Edad","País","Fecha"],
    index_col="País",
    parse_dates=["Fecha"],
    encoding="utf-8"
)
df_leido

           Nombre  Edad      Fecha
País
México        Ana    25 2023-01-01
Argentina    Luis    36 2023-02-15
Chile       Sofía    29 2023-03-20
Perú       Miguel    40 2023-04-05

In [ ]:
[x.strip() for x in " apple, banana, cherry ".strip().split(",")]
[x.strip() for x in " red , green , blue ".strip().split(",")]
" dog , cat , mouse ".strip().split(",")
" John , Paul , George , Ringo ".strip().split(",")
" blue | yellow | pink ".strip().split("|")
import re
re.split("[,|]","a,b|c,d|e")
" car , bike , bus ".strip().split(",")
" apple,banana,cherry ".strip().split(" ")
" word1 , word2 , word3 ".strip().split(",")

['word1 ', ' word2 ', ' word3']